#ifndef __UL_CHARTYPE_EXT_H__
#define __UL_CHARTYPE_EXT_H__

const char * DBCTable_ext[] = {
    "ｓ", "ｒ", "ｑ", "ｐ", "ｗ", "ｖ", "ｕ", "ｔ", "ｚ", "ｙ", "ｘ", "ｃ", "ｂ", "ａ", "ｇ", "ｆ", "ｅ", "ｄ", "ｋ", "ｊ", "ｉ", "ｈ", "ｏ", "ｎ", "ｍ", "ｌ", "Ｐ", "Ｑ", "Ｒ", "Ｓ", "Ｔ", "Ｕ", "Ｖ", "Ｗ", "Ｘ", "Ｙ", "Ｚ", "Ａ", "Ｂ", "Ｃ", "Ｄ", "Ｅ", "Ｆ", "Ｇ", "Ｈ", "Ｉ", "Ｊ", "Ｋ", "Ｌ", "Ｍ", "Ｎ", "Ｏ",
    "｛", "¨", "＇", "～", "｝", "｜", "｀", " ", "ˇ", "〔", "ˉ", "【", "·", "∶", "〕", "］", "：", "；", "？", "！", "＂", "…", "（", "）", "，", "．", "—", "‖", "’", "‘", "［", "”", "“", "〖", "〗", "〈", "〉", "《", "》", "「", "」", "『", "』", "、", "。", "〃", "々", "】",
    "｛", "～", "｝", "｜", "｀", "：", "；", "＜", "＝", "＞", "？", "！", "＂", "＃", "＄", "％", "＆", "＇", "（", "）", "＊", "＋", "，", "－", "．", "／", "︿", "［", "＼", "］", "＿", "＠",
    "〓", "⊕", "﹏", "﹎", "﹍", "﹌", "﹊", "﹉", "°", "﹄", "﹃", "﹂", "﹁", "﹀", "△", "▲", "○", "ˇ", "∮", "卍", "Š", "/", "▼", "□", "■", "￡", "Õ", "￣", "▪", "★", "☆", "Ψ", "¤", "℡", "®", "™", "※", "‡", "†", "囍", "§", "‥", "◆", "◇", "―", "︵", "卐", "\\", "◎", "●", "︼", "︽", "︾", "︿", "︸", "︹", "︺", "︻", "︴", "╳", "︶", "︷", "©", "«", "Θ", "＿", "№", "╮", "╯", "⊙", "╭", "▽", "㈱", "♂", "╰", "♀", "»",
    "∈", "≥", "∏", "‰", "″", "Å", "√", "∝", "∞", "∑", "⌒", "×", "⊙", "∩", "∨", "∫", "∪", "Ω", "∮", "∠", "㎝", "∥", "∧", "￥", "⅛", "∽", "￠", "⅜", "⅝", "⅞", "÷", "∴", "∷", "㏄", "¤", "≌", "′", "ℓ", "≈", "⊥", "＜", "＝", "＞", "㎎", "＄", "％", "㎡", "＋", "≒", "－", "≮", "≯", "℃", "￡", "╲", "∵", "≤", "╱", "℉", "≠", "≡", "≦", "㎞", "±", "Ｆ", "≧", "¼", "½", "¾", "㎜", "º", "㎏",
    "Ⅺ", "Ⅻ", "Ⅸ", "Ⅹ", "Ⅲ", "Ⅳ", "Ⅰ", "Ⅱ", "Ⅶ", "Ⅷ", "Ⅴ", "Ⅵ", "ⅸ", "ⅹ", "ⅳ", "ⅰ", "ⅱ", "ⅶ", "ⅷ", "ⅴ", "ⅵ", "㊣", "㈠", "㈡", "㈢", "㈣", "㈤", "㈥", "㈦", "㈧", "㈨", "㈩", "⑦", "⑧", "⑤", "⑥", "③", "④", "①", "②", "⑨", "⑩", "⑶", "⑷", "⑴", "⑵", "⑾", "⑿", "⑼", "⑽", "⑺", "⑻", "⑸", "⑹", "⒛", "⒚", "⒙", "⒘", "⒗", "⒖", "⒕", "⒔", "⒓", "⒒", "⒑", "⒐", "⒏", "⒎", "⒍", "⒌", "⒋", "⒊", "⒉", "⒈", "⒇", "⒆", "⒅", "⒄", "⒃", "⒂", "⒁", "⒀", "０", "１", "２", "３", "４", "５", "６", "７", "８", "９",
    "ω", "ψ", "χ", "φ", "υ", "τ", "σ", "ρ", "π", "Ψ", "Ω", "Π", "Ρ", "Σ", "Τ", "Υ", "Φ", "Χ", "θ", "ι", "κ", "λ", "μ", "ν", "ξ", "ο", "α", "β", "γ", "δ", "ε", "ζ", "η", "Θ", "Ι", "Κ", "Λ", "Μ", "Ν", "Ξ", "Ο", "Α", "Β", "Γ", "Δ", "Ε", "Ζ", "Η", "ё", "с", "р", "у", "т", "х", "ф", "ч", "ц", "щ", "ш", "ы", "ъ", "э", "ь", "я", "ю", "в", "г", "а", "б", "ж", "з", "д", "е", "к", "л", "и", "й", "о", "п", "м", "н", "Т", "У", "Р", "С", "Ц", "Ч", "Ф", "Х", "Ъ", "Ы", "Ш", "Щ", "Ю", "Я", "Ь", "Э", "В", "Г", "А", "Б", "Ж", "З", "Д", "Е", "К", "Л", "И", "Й", "О", "П", "М", "Н", "Ё",
    "↓", "→", "↑", "←", "↗", "↖", "↙", "↘",
    "ほ", "ぺ", "べ", "へ", "み", "ま", "ぽ", "ぼ", "び", "ひ", "ぱ", "ば", "ぷ", "ぶ", "ふ", "ぴ", "に", "な", "ど", "と", "は", "の", "ね", "ぬ", "っ", "ぢ", "ち", "だ", "で", "て", "づ", "つ", "せ", "ず", "す", "じ", "た", "ぞ", "そ", "ぜ", "こ", "げ", "け", "ぐ", "し", "ざ", "さ", "ご", "か", "お", "ぉ", "え", "く", "ぎ", "き", "が", "ぃ", "あ", "ぁ", "る", "ぇ", "う", "ぅ", "い", "ゃ", "ょ", "ら", "ゎ", "り", "よ", "わ", "も", "れ", "や", "ろ", "む", "を", "ん", "ゅ", "め", "ゆ",
    "ノ", "ブ", "パ", "ト", "リ", "ン", "バ", "ロ", "レ", "ワ", "ヮ", "ラ", "ビ", "ル", "ヤ", "ュ", "ヌ", "ョ", "ヒ", "ネ", "ム", "ャ", "ド", "ア", "ィ", "ミ", "ァ", "ウ", "ェ", "イ", "ゥ", "オ", "カ", "エ", "ォ", "ギ", "ク", "ガ", "キ", "ゲ", "コ", "グ", "ケ", "ザ", "シ", "ゴ", "サ", "ズ", "セ", "ジ", "ス", "ゾ", "タ", "ゼ", "ソ", "ポ", "モ", "ニ", "ボ", "ハ", "ユ", "ナ", "メ", "ヅ", "マ", "ツ", "ベ", "ヲ", "デ", "ヘ", "テ", "ホ", "チ", "ペ", "ダ", "フ", "ッ", "ピ", "ヂ", "プ", "ヨ",
    "ō", "ǖ", "ㄆ", "ǔ", "ǒ", "ǐ", "ㄍ", "ㄎ", "ǜ", "ㄈ", "ǚ", "ㄊ", "ǘ", "ㄔ", "ㄕ", "ㄖ", "ㄗ", "ㄐ", "ㄑ", "ㄒ", "ㄓ", "ㄇ", "ǎ", "ㄞ", "ㄟ", "ㄘ", "ㄙ", "ㄚ", "ㄛ", "ㄤ", "ê", "é", "è", "ㄠ", "ㄡ", "í", "ì", "á", "à", "ㄨ", "ㄩ", "ú", "ù", "ㄢ", "ㄝ", "ü", "ó", "ò", "ㄏ", "ㄉ", "ㄥ", "ㄜ", "ㄦ", "ā", "ㄧ", "ě", "ㄋ", "ㄅ", "ē", "ī", "ū", "ㄣ",
    "┕", "└", "┗", "┖", "┑", "┐", "┓", "┒", "┝", "├", "┟", "┞", "┙", "┘", "┛", "┚", "┅", "┄", "┆", "━", "─", "│", "┍", "┌", "┏", "┎", "┉", "┈", "┊", "┵", "┴", "┷", "┶", "┱", "┰", "┳", "┲", "┽", "┼", "┿", "┾", "┹", "┸", "┻", "┺", "┥", "┤", "┧", "┦", "┡", "┠", "┣", "┢", "┭", "┬", "┯", "┮", "┩", "┨", "┫", "┪", "╊", "╋", "╈", "╉", "╂", "╀", "╁", "╆", "╇", "╄", "╅",
};

#define DBC_EXT_TABLE_SIZE 791
#define DBC_EXT_LETTER_OFFSET 0
#define DBC_EXT_LETTER_SIZE 52
#define DBC_EXT_CHINESE_OFFSET 52
#define DBC_EXT_CHINESE_SIZE 48
#define DBC_EXT_ENGLISH_OFFSET 100
#define DBC_EXT_ENGLISH_SIZE 32
#define DBC_EXT_SPECIAL_OFFSET 132
#define DBC_EXT_SPECIAL_SIZE 77
#define DBC_EXT_MATH_OFFSET 209
#define DBC_EXT_MATH_SIZE 72
#define DBC_EXT_ORDER_OFFSET 281
#define DBC_EXT_ORDER_SIZE 92
#define DBC_EXT_SLAVIC_OFFSET 373
#define DBC_EXT_SLAVIC_SIZE 114
#define DBC_EXT_ARROW_OFFSET 487
#define DBC_EXT_ARROW_SIZE 8
#define DBC_EXT_HIRAGANA_OFFSET 495
#define DBC_EXT_HIRAGANA_SIZE 81
#define DBC_EXT_KATAKANA_OFFSET 576
#define DBC_EXT_KATAKANA_SIZE 81
#define DBC_EXT_PHONETIC_OFFSET 657
#define DBC_EXT_PHONETIC_SIZE 62
#define DBC_EXT_TABULATION_OFFSET 719
#define DBC_EXT_TABULATION_SIZE 72

enum {
    CHAR_LETTER_TYPE_EXT,
    CHAR_CHINESE_TYPE_EXT,
    CHAR_ENGLISH_TYPE_EXT,
    CHAR_SPECIAL_TYPE_EXT,
    CHAR_MATH_TYPE_EXT,
    CHAR_ORDER_TYPE_EXT,
    CHAR_SLAVIC_TYPE_EXT,
    CHAR_ARROW_TYPE_EXT,
    CHAR_HIRAGANA_TYPE_EXT,
    CHAR_KATAKANA_TYPE_EXT,
    CHAR_PHONETIC_TYPE_EXT,
    CHAR_TABULATION_TYPE_EXT,
} CHARTYPES_EXT;

#endif  // end for __UL_CHARTYPE_EXT_H__
